# Файл для всяких полезных вещей


# Расписание для конкретной олимпиады
class TimeTable:
    def __init__(self, grades, subjects):
        self.grades = grades.split(', ')
        self.subjects = subjects.split(', ')
        self.dates = {}
        self.empty = True

    def add(self, subject, grade, value):
        """Добавляем дату к конкретному предмету и классу"""
        self.empty = False
        if subject in self.dates:
            self.dates[subject][grade] = value
        else:
            self.dates[subject] = {grade: value}


CITIES = [('Барнаул', 'Барнаул'), ('Владивосток', 'Владивосток'), ('Волгоград', 'Волгоград'), ('Воронеж', 'Воронеж'),
          ('Екатеринбург', 'Екатеринбург'), ('Ижевск', 'Ижевск'), ('Иркутск', 'Иркутск'), ('Казань', 'Казань'),
          ('Кемерово', 'Кемерово'), ('Краснодар', 'Краснодар'), ('Красноярск', 'Красноярск'),
          ('Махачкала', 'Махачкала'), ('Москва', 'Москва'), ('Нижний Новгород', 'Нижний Новгород'),
          ('Новосибирск', 'Новосибирск'), ('Омск', 'Омск'), ('Оренбург', 'Оренбург'), ('Пермь', 'Пермь'),
          ('Ростов-на-Дону', 'Ростов-на-Дону'), ('Самара', 'Самара'), ('Санкт-Петербург', 'Санкт-Петербург'),
          ('Саратов', 'Саратов'), ('Тольятти', 'Тольятти'), ('Томск', 'Томск'), ('Тюмень', 'Тюмень'),
          ('Ульяновск', 'Ульяновск'), ('Уфа', 'Уфа'), ('Хабаровск', 'Хабаровск'), ('Челябинск', 'Челябинск'),
          ('Ярославль', 'Ярославль')]

SUBJECTS = [('Английский язык', 'Английский язык'), ('Астрономия', 'Астрономия'),
            ('Биология', 'Биология'), ('География', 'География'),
            ('Информатика', 'Информатика'), ('Испанский язык', 'Испанский язык'),
            ('История', 'История'), ('Китайский язык', 'Китайский язык'),
            ('Литература', 'Литература'), ('Математика', 'Математика'),
            ('МХК', 'МХК'), ('Немецкий язык', 'Немецкий язык'),
            ('Обществознание', 'Обществознание'), ('ОБЖ', 'ОБЖ'),
            ('Русский язык', 'Русский язык'), ('Физика', 'Физика'),
            ('Физкультура', 'Физкультура'), ('Философия', 'Философия'),
            ('Французский язык', 'Французский язык'), ('Химия', 'Химия'),
            ('Экология', 'Экология'), ('Экономика', 'Экономика')]

GRADES = [('1', '1'), ('2', '2'), ('3', '3'), ('4', '4'),
          ('5', '5'), ('6', '6'), ('7', '7'), ('8', '8'),
          ('9', '9'), ('10', '10'), ('11', '11')]

# В названиях файлов не поддерживается кириллица
RUS_TO_ENG = {
    "Астрономия": "Astronomy",
    "География": "Geography",
    "Испанский язык": "Spanish",
    "История": "History",
    "Китайский язык": "Chinese",
    "МХК": "MHK",
    "Немецкий язык": "German",
    "Обществознание": "Social",
    "ОБЖ": "OBJ",
    "Физкультура": "PE",
    "Философия": "Philosophy",
    "Французский язык": "French",
    "Экология": "Ecology",
    "Экономика": "Economy",
    "Математика": "Math",
    "Русский язык": "Russian",
    "Информатика": "Informatics",
    "Физика": "Physics",
    "Литература": "Literature",
    "Английский язык": "English",
    "Химия": "Chemistry",
    "Биология": "Biology"
}
